[{"description": ["The climb to Angel’s Rest above Pearisburg is notorious among Appalachian Trail hikers for its punishing incline. You must endure a 1.5-mile, 1,650-ft. climb before you can sprawl over a boulder enjoying the view of the New River. The hike is 4.6 miles round trip.", "The well-worn trail leads into a spring-fed ravine and briefly along an old logging road before settling into a consistent, thrashing course of switchbacks. The path crosses over two ancient rockslides and passes through thick poplar and oaks, as well as laurel and rhododendron.", "Gradually, the thriving hardwood forest of the lowlands gives way to stunted oaks and shrubs. When you reach the boulders at the top, detour a few hundred feet to the right on a blue-blazed trail for a view of Pearisburg and the twisting New River. The A.T. continues to the crest of Angel’s Rest and follows along a rock ledge overhanging Wilburn Valley for spectacular views."], "location": ["37.3162", "-80.7617"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=536043", "name": "Angel’s Rest"}, {"description": ["Apple Orchard Falls is one of Virginia’s tallest and most spectacular waterfalls. Singing streams, dancing down cascades, huge boulders, and thick stands of forest surround stunning vistas and towering bluff lines. The 7.5-mile loop trail is moderately difficult.", "Apple Orchard Mountain was named for the nature of the dominant northern red oak forests on its summits and ridges. The weather is so severe on the upper elevations of the mountain that the trees have taken on a stunted appearance, as if they have been trimmed and pruned over the decades.The Appalachian Trail and the Blue Ridge Parkway pass within a short distance of the top of Apple Orchard Mountain."], "location": ["37.529711", "-79.553143"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=525996", "name": "Apple Orchard Falls"}, {"description": ["Beards Gap Trail starts up right side from the Douthat State Park visitor center, and initially passes over a wooden footpath. Follow the blue-blazed trail as it heads up the gap. The trail will make several switchbacks before arriving at the ridge, and intersection of the Bushy Hollow and Mountain Top trails in 1.1 miles.", "Follow several other trails for a 5+ mile loop hike."], "location": ["37.97", "-79.72"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526543", "name": "Beards Mountain Trail"}, {"description": ["The Blue Suck Falls Trail is a 8-mile moderate to difficult multi-use trail that connects several of the trails in the northwest region of the park to the trail head near the visitor center at Douthat State Park.", "The falls and trail get their unusual name from the Appalachian term for a whirlpool or a “suck,” which may be found at the base of the falls. At higher elevations, the trail traverses the ridge top, often along a narrow path, and connects to the George Washington National Forest trail network. The trail features several east facing overlooks of the Alleghenies such as Lookout Rock. A highlight of the trail are the views of Blue Suck Falls. This rocky trail is actually steeper and more difficult at lower elevations."], "location": ["37.9045714", "-79.8211623"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526514", "name": "Blue Suck Falls"}, {"description": ["Forming the headwaters of the Roanoke River, Bottom Creek Gorge boasts spectacular scenery including the second highest waterfall in Virginia, virgin hemlocks, and hundreds of wildflowers.", "Bottom Creek is a powerful mountain stream that forms a stair-step series of broad-basin waterfalls known as the “kettles.” One of the headwater streams of the South Fork of the Roanoke River, Bottom Creek boasts a 200-foot high waterfall. Flanking Bottom Creek are forests of mixed hardwoods (tulip poplar, maple, oak, hickory) and upland meadows. Five rare species thrive in this habitat."], "location": ["37.131043", "-80.186548"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=541088", "name": "Bottom Creek Gorge"}, {"description": ["Buck Mountain Trail is a very short trail that takes you away from the parking lot and instantly into a virtually untouched spot in nature. There are rocks to climb, trees to explore and wonderful spots to sit and listen to the birds around you.", "Buck Mountain Trail is located in the upper parking lot of Roanoke Mountain Loop Road, located off the Blue Ridge Parkway at Milepost 120."], "location": ["37.211006", "-79.935908"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=441292", "name": "Buck Mountain Trail"}, {"description": ["Buck Run and Locust Spring Run Trails are located on the turn-of-the-century railroad tram grades used by the previous landowner to log virgin timber.", "The 2.9-mile Buck Run trail provides a spectacular view of beaver ponds, open glades, and bogs.", "The 3.1-mile Locust Spring Run trail provides views of northern hardwoods and is ideal for viewing whitetail deer and wild turkey."], "location": ["38.58542", "-79.64230"], "map_embed": null, "name": "Buck Run & Locust Spring Run Trails"}, {"description": ["Buffalo Mountain, outside of Floyd, is one of the most significant natural areas in Virginia. It boasts an amazing 13 rare plant occurrences, three rare animal occurrences, and six significant natural communities. The combination of high-elevation (3,971 feet), wind-exposed openings at the summit, and magnesium rich soils make it unlike any place else in Virginia.", "Public access facilities include a small parking area and a steep 1 mile hiking trail to the treeless summit."], "location": ["36.789285", "-80.455334"], "map_embed": null, "name": "Buffalo Mountain Natural Area Preserve"}, {"description": ["Carvins Cove Natural Reserve is the second largest municipal park in the nation. It holds a major water source within its 12,700 acres and overflowing recreational opportunities including hiking, biking, fishing, and boat rentals. The cove includes 11,363 acres that are protected by the largest conservation easement in Virginia’s history.", "With more than 60 miles of trails and an 800-acre reservoir Carvins Cove is a mountain biking, hiking, horseback riding, fishing, and boating paradise."], "location": ["37.384924", "-80.006089"], "map_embed": null, "name": "Carvins Cove Natural Reserve"}, {"description": ["The trail leads to Cascade Falls, one of the most beautiful waterfalls (69 feet) in Virginia and possibly on the entire East Coast. Little Stony Creek cascades over a vertical cliff in several different streams.", "~ 3.5 miles in length, out and back hike", "Easy to moderate difficulty", "There is a day-use fee of $3 (cash only)", "Map kiosk at trail head (straight forward hike)"], "location": ["37.353725", "-80.599256"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=441205", "name": "Cascade Falls Trail"}, {"description": ["The Chestnut Ridge Trail is located along the Blue Ridge Parkway. It is a wide and well-graded path lined with mountain laurel and rhododendron and includes a 5.4 mile figure-eight loop trail that can be shortened to 2.5 or 3.4 miles.", "The easy to moderate trail is just 10 minutes from Downtown Roanoke and is also adequate for horseback riders."], "location": ["37.233783", "-79.951878"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=454116", "name": "Chestnut Ridge Trail"}, {"description": ["This trail offers 2.67 miles of excellent hiking in the Hidden Valley Recreation Area.", "This trail meanders through a variety of habitats and offers many opportunities to view wildlife. Begin at the shale pit and take the short climb to the ridge top before ascending to the Chimney Run crossing. Enjoy rock formations and the cool stream environment while you cross over a wooden bridge. Hike through a small field with views of the Warwick Mansion and the Hidden Valley fields. Enter the woods in a serene valley located next to a wildlife pond, where it is common to observe waterfowl. Continue on an old road bed that leads to Muddy Run and the Jackson River. The trail ends on the Muddy Run Trail, approximately 1.5 miles northeast of the parking lot by Warwick Mansion."], "location": ["38.09401", "-79.81623"], "map_embed": null, "name": "Cobbler Mountain Trail"}, {"description": ["Crabtree Falls is arguably the most beautiful set of waterfalls in Virginia. Billed as the tallest waterfalls east of the Mississippi, Crabtree Falls is a must see for anyone who lives in the mid-Atlantic region.", "Arrive at the top of the falls just 1.1 miles from the parking area and cross over a wooden bridge to an overlook. From here you can’t see Crabtree Falls below as it falls away, but there is sill a nice view of the valley floor and Blue Ridge Mountains. Don’t be tempted to climb over the stone wall onto the uppermost portion of the falls. The rocks are covered with a very slippery algae."], "location": ["37.851446", "-79.079219"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=593714", "name": "Crabtree Falls"}, {"description": ["Devil’s Marbleyard includes a steep incline for most of the trip, but is well worth the time. The trail is not marked well, but you can follow the blue blazes until the end of the Belfast Trail.  Then continue to follow the trail.", "The hike itself is not that long, about 45 minutes, but you will definitely want to plan time to stay at the marbleyard and explore.", "Devil’s Marbleyard is a boulder field, with many rocks that are the size of a car. The Antietam Quartzite found at the site is the result of a rise in sea level relative to the land that occurred over 500 million years ago. The boulders have tube-like structures running along them that are believed to be fossilized cavities where worm-like creatures lived."], "location": ["37.5812469", "-79.4717023"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=450821", "name": "Devil’s Marbleyard"}, {"description": ["Dismal Falls is a 15-foot, multi-tiered waterfall on Dismal Creek. It is easily accessed from the road or from a side trail off of the Appalachian Trail.", "Dismal Creek is about 50 feet wide (depending on water volume) at this point as it flows down over several ledges. The ledges on the left side of the falls are step-like while the middle and right ledges are more of a straight drop. In lower water, the middle and right are not covered and the stream is much narrower. Despite the width of the stream, the waterfall is not particularly open with trees lining each bank and throwing much of the falls into shade most of the day."], "location": ["37.1884529", "-80.9003564"], "map_embed": null, "name": "Dismal Falls"}, {"description": ["Dragon’s Tooth is a unique geologic feature that consists of Tuscarora quartzite spires which outcrop on the top of Cove Mountain. The tallest “tooth” projects roughly 35 feet above the surrounding rock. The trail to Dragon’s Tooth ascends steep, rugged outcrops of quartzite which form the spine of Cove Mountain and North Mountain. The spine is known as Dragon’s Back.", "A difficult 4.5-mile round trip hike, Dragon’s Tooth summit offers magnificent views of nearby and distant peaks year-round.", "The bouldering area is pretty far from the parking lot. After hiking several miles on the", "Dragon’s Tooth Trail", "you will come to several large fins that are pretty big. The super classic line is the obvious Finger Crack. There is much to be had in the V3 and under category."], "location": "6128 Catawba Valley Dr., Catawba, VA 24070", "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=392462", "name": "Dragon’s Tooth"}, {"description": ["Explore Park Trail System, located adjacent to the Blue Ridge Parkway, is a 1,100-acre preserve, situated along the Roanoke River Gorge, offering both IMBA-certified mountain bike trails and access to hundreds of miles of the Blue Ridge Parkway. Mountain bike trail options (6+) ranging from 0.5 miles to 10+ miles. Many of the trails are loop trails, and are easy to moderately difficult.", "Explore Park is also home to several trail running events created by", "Mountain Junkies."], "location": ["37.262031", "-79.884338"], "map_embed": null, "name": "Explore Park"}, {"description": ["Fairy Stone State Park, the largest of Virginia’s six original state parks (4,741 acres), is home to its namesake “fairy stones.” These rare mineral crosses and the park’s scenic beauty, rich history, and ample recreational opportunities make it a local and regional favorite.", "More than 9 miles of multi-use trails and a 168-acre lake will keep you busy. The park is also just minutes from the Blue Ridge Parkway."], "location": "967 Fairystone Lake Dr, Stuart, VA, VA 24171", "map_embed": null, "name": "Fairy Stone State Park"}, {"description": ["Falling Spring Falls is a breathtaking 80-foot waterfall that is one of the most visited and photographed spots in the Alleghany Highlands. The waterfall is on Route 220, just 5 miles north of Covington. This is one of the largest waterfalls in Virginia and cascades from an overhanging ledge that is visible from the roadway.", "Thomas Jefferson described Falling Spring as a", "“remarkable cascade … falling over a rock about 200 feet to the valley below.”"], "location": ["37.867478", "-79.947124"], "map_embed": null, "name": "Falling Spring"}, {"description": ["Falls Ridge Natural Preserve features two trails totaling 5 miles. With its nice hiking trails, beautiful waterfall, intriguing caves, rare plants, and convenient location, the Falls Ridge Preserve gets lots of attention. Falls Ridge Preserve is owned and protected by", "The Nature Conservancy", ".", "Part of a steep, rugged ridge that rises from the valley of the North Fork of the Roanoke River, Falls Ridge Preserve boasts a spring-fed travertine waterfall approximately 80 feet in height.", "Salem Fault runs through the preserve, dividing it into two different rock types-Precambrian limestone and shale/sandstone. The corresponding difference in soil types generates a diversity of vegetation, particularly wildflowers and smaller flora.", "The rocks in the travertine falls watershed grew steadily, as minerals and lime dissolved in the water precipitate upon them. Over thousands of years, the build-up of calcium carbonate steepened the stream’s gradient and slowly created both the waterfall and one of the largest-known exposed travertine deposits. Large sinkholes on part of the land also indicate the existence of underlying caverns which have never been explored."], "location": ["37.191989", "-80.317011"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526029", "name": "Falls Ridge Natural Preserve"}, {"description": ["Fenwick Mines was once an old mining area and is now home to trails and a recreation park. The trail takes you by open pit mines and foundations of old mining structures.", "The Fenwick Forest Walk is a 1-mile nature trail. The Wetland Trail allows you to observe wetlands created by beavers; follow the trail through wetlands and open forests to see a variety of wildlife and vegetation that live in this environment.", "The trails are wheelchair accessible. The site has a large picnic shelter, grills, toilets, and a fishing pond."], "location": ["37.574192", "-80.055329"], "map_embed": null, "name": "Fenwick Mines"}, {"description": ["A 7-mile loop trail that provides good views of Craig Creek Valley and Potts Mountain. Lick Branch offers a cool refreshing walk, except during dry periods. A sign marks intersection of the Lick Branch and Ferrier trails."], "location": ["37.5730336", "-80.1142954"], "map_embed": null, "name": "Ferrier Trail & Lick Branch Loop"}, {"description": ["A classic Virginia 5.2 mile round trip (out and back) hike at the Peaks of Otter. Flat Top is a lovely trail full of wonderful views, large rock formations, and flora that changes with each turn, including huge oak, poplar, hickory, and beech trees, mountain laurel, rhododendron, and an assortment of wildflowers."], "location": ["37.45200", "-79.583"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526502", "name": "Flat Top"}, {"description": ["A remote 14-mile trail that passes near the highest point in the Allegheny Mountains. It passes through upland hardwoods and pines that are typical of high elevation forests. It is part of a trail system around Douthat State Park."], "location": ["37.78", "-79.96"], "map_embed": null, "name": "Fore Mountain Trail"}, {"description": ["Franklin County Recreation Park is a 150-acre park, located south of Rocky Mount (just 2 miles from Route 220). The park offers a variety of outdoor activities for all ages including, fishing in a 3-acre lake. It hosts various special events and athletic tournaments.", "Amenities include:", "2 picnic shelters (available for rent and drop-in)", "Playgrounds", "Lighted tennis courts", "Basketball court", "Sand volleyball court", "Horseshoe pit", "Disc golf trail", "Hiking and biking trails", "Baseball and soccer fields"], "location": "2150 Sontag Road, Rocky Mount, VA 24151", "map_embed": null, "name": "Franklin County Recreation Park"}, {"description": ["Grassy Hill is a prominent landmark on the west side of Rocky Mount. The site is characterized by rocky slopes forested with hardwood species and scattered patches of Virginia pine. Shallow, basic, heavy-clay soils predominate and outcrops of magnesium-rich bedrock are common. These unusual soil and rock substrates provide habitat for rare woodland communities. Several rare plants grow in small grassy openings near the hill’s summit.", "The trail includes 6.6 miles of hiking trails with signage. Parking for trail users is available adjacent to the preserve."], "location": ["37.006", "79.9199"], "map_embed": null, "name": "Grassy Hill Natural Area Preserve Hiking Trail"}, {"description": ["Greenways are open-space corridors reserved for recreational use or environmental preservation that connect urban centers.", "Most greenways can be found along rivers, across ridgelines and along other scenic or historic routes. These spaces often have hiking or multi-use trails, which help link Roanoke’s natural beauty to its charming neighborhoods and vibrant downtown. There are more than 30 miles of greenways throughout the Roanoke Region."], "location": "1119 Wiley Dr SW, Roanoke, VA 24015", "map_embed": null, "name": "Greenways"}, {"description": ["Located in Salem, the historical Hanging Rock Battlefield Trail offers a touch of local and national history, as well as a pleasant place to walk off lunch. Many wildflowers grow along the trail.", "A simple cinder trail winds along the edges of Mason Creek. This rails to trails form allows for quiet solitude away from the traffic. The trail is popular with walkers in the afternoon. Look for falling rock, historical markers, and flowers and berries."], "location": ["37.327888", "-80.040139"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=471364", "name": "Hanging Rock Battlefield Trail"}, {"description": ["A half-hour hike with great views. The hike takes you to the observatory. Since 1952, Hanging Rock has been a monitoring point for hawk, eagle, falcon, and osprey migration along the birds’ eastern route.", "Hanging Rock Tower is a simple forest service fire tower on top of a mountain. There is no electricity, running water, or bathroom facilities other than an outdoor privy. You need to take drinking water. Other items you may want to take are binoculars, food, sunglasses, an extra layer of clothing, sunscreen, hat, bird books, and comfortable hiking shoes.", "The hike up the mountain takes 20 to 40 minutes."], "location": ["37.509877", "-80.43803"], "map_embed": null, "name": "Hanging Rock Raptor Observatory"}, {"description": ["The lowliest of the three Peaks of Otter, Harkening Hill is the only one with a “loop” trail that swings by the top. A gain of just under 1,000 feet from the parking lot makes it a decent 3.5-mile walk. Harkening Hill sees far less traffic than the bigger Sharp Top, so the trail is in better shape. Many interesting granite boulder formations are found on Harkening Hill.", "The loop trail that includes the summit of Harkening Hill starts immediately behind the visitor center. Side trips from the 3.3 mile loop include a trip to “Balance Rock” which is an impressive granite boulder balanced on a smaller one and a trip to Johnson Farm which provides a glimpse of the agricultural history.", "If you park somewhere centrally at Peaks of Otter (such as the visitor center or the Sharp Top parking lot), you can hike the Harkening Hill loop and then link to the out-and-back hikes up Flat Top and Sharp Top for a total of about 12 miles."], "location": ["37.458069", "-79.616885"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=582438", "name": "Harkening Hill"}, {"description": ["Hoop Hole Loop has two loops. The lower loop is 4 miles and skips the views from the ridge top and the extended loop is 9 miles. Both loops offer beautiful views of the streams cascading over rocks and swimming holes.", "The longer loop climbs to the top of the ridge for scenic views of the surrounding mountains. One could try to reach certain cliffs from the ridgetop for more expanded views. The trail is very rugged and good footwear is necessary. Also, the trail makers are sometimes difficult to see with yellow blazes."], "location": ["37.67311", "-79.91759"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526016", "name": "Hoop Hole"}, {"description": ["The Huckleberry Trail is an asphalt-paved bike and pedestrian path. The trail runs from the Blacksburg Library past the New River Mall in Christiansburg. There are markers every half mile and benches spaced along the trail where you can rest and enjoy the scenery.", "Parking is available at both ends as well as near Warm Hearth and the Hightop and Merrimac Road crossings. The trail is 5.7 miles in length with easy walking and biking options."], "location": ["37.2257225", "-80.413153"], "map_embed": null, "name": "Huckleberry Trail"}, {"description": ["A 17-mile trail in Alleghany County, Virginia, which runs from Covington to the Coles Point Recreation Area at Lake Moomaw. The trail, which was developed from an old railroad bed, provides access to many natural, historic and scenic resources.", "The Jackson River, running adjacent to the trail, contributes a distinct and scenic landscape feature, while providing a natural habitat for reproducing wild trout. There are 14 miles open to the public for those who enjoy hiking, biking, and nature walks."], "location": ["37.851548", "-79.979339"], "map_embed": null, "name": "Jackson River Scenic Trail"}, {"description": ["A 21.9-mile section of the Appalachian Trail that parallels the James River. This moderately strenuous trail overlooks the James River Water Gap and offers multi-day hiking and camping options.", "This is a challenging hike and requires some logistics in setting up a car shuttle because it is a one-way hike on the A.T. Leave a car at the James River Foot Bridge A.T. parking lot then drive to the Blue Ridge Parkway on Route 501 and head south to Sunset Field (MP 78.4) for the second car."], "location": ["37.596870", "-79.391370"], "map_embed": null, "name": "James River Wilderness Trail"}, {"description": ["A 6.6 mile, out and back hike on the Appalachian Trail, Kelly Knob is located on a ridge that bridges the valley between John’s Creek Mountain and Clover Hollow Mountain and is immediately off of the Appalachian Trail. While Kelly Knob is not the highest point on the ridgelet (the high point is densely wooded), it is still much higher than its mountain neighbors with a fantastic vista of the New River Valley.", "A shorter option", "(4 miles round trip)", "approaches Kelly Knob from the opposite direction.", "Sandstone bedrock forms a broken escarpment along the east and south of the ridge, and the area around Kelly Knob is particularly striking with 50 foot cliffs containing deep fissures in the rock. The trails to Kelly Knob are well signed and traveled."], "location": ["37.3541852801", "-80.3915333748"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526021", "name": "Kelly Knob"}, {"description": ["A 2.3-mile (round trip) hike up Potts Mountain. The trail passes through the Barbours Creek Wilderness Area and is located near Pines Campground.", "Elevation on top of Potts Mountain is over 3,600 feet, affording great views in all directions. There are no facilities on trail, but connector (white-blazed) trailheads to Pines Campground have hand pump for water and vault toilets."], "location": ["37.603094", "-80.078097"], "map_embed": null, "name": "Lipes Branch Trail"}, {"description": ["McAfee Knob is the most photographed site along the Appalachian Trail. The knob has an almost 270-degree panorama view of the Catawba Valley and North Mountain to the west, Tinker Cliffs to the north and the Roanoke Valley to the east.", "The trail begins on the opposite side of Route 311 from the parking lot. Cross with caution. Travel north on the Appalachian Trail to McAfee Knob by following the white blazes, which are 6-inch rectangular paint marks placed periodically on trees at eye level."], "location": ["37.380252", "-80.089421"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=438253", "name": "McAfee Knob"}, {"description": ["The McDowell Battlefield Trail leads to the top of Sittlington Hill and the core of the McDowell Battlefield. A marker will direct you either east returning to the parking area or west to continue to the western end of the trail.", "The eastern end of the trail starts on the south side of Route 250 at the battlefield parking area, approximately 1 mile from the top of Bullpasture Mountain. The western end of the trail starts on the south side on Route 250, directly across from the old mill on the Bullpasture River."], "location": ["38.3242647141", "-79.4655865431"], "map_embed": null, "name": "McDowell Battlefield Trail"}, {"description": ["Less than 5 minutes from downtown Roanoke, Mill Mountain Park offers incredible mountain biking (9 miles) within 5 minutes of downtown Roanoke. The trails encompass Roanoke’s highest point – the summit of Mill Mountain (1,703 feet) and the Roanoke Star. This area offers 900 acres of parkland atop Mill Mountain, picnic areas, two overlooks that provide 20-60 mile vistas, access to additional hiking trails, the Mill Mountain Zoo, and Mill Mountain Discovery Center.", "Watch a video", "of mountain biking on Mill Mountain", "See live video from the StarCam", "Download a", "Mill Mountain Park Trail Map", "Mapped ride", "at Mill Mountain Park"], "location": ["37.257181", "-79.941673"], "map_embed": null, "name": "Mill Mountain Park"}, {"description": ["The Mountain Lake Conservancy manages 2,600 acres of mountainous terrain that encompasses a unique ecosystem due to an average elevation of more than 4,000 feet.", "More than 20 miles of fern-lined trails on the property are open to the public for biking year-round. The trails are home to the “Dirty Dawg MTB Race” and offer trail options for all experience levels. Mountain Bike rentals as available at Mountain Lake Hotel."], "location": "115 Hotel Circle, Pembroke, VA, VA 24136", "map_embed": null, "name": "Mountain Lake Conservancy"}, {"description": ["The Poverty Creek Trail system (also known as Pandapas Pond) is a network of multi-use trails perfect for hiking, running, horseback riding, and mountain biking. There are more than 20 miles of trails of varying degrees of difficulty.", "Poverty Creek Trail is the easiest of the trails in this system. It is a series of small ups and downs and is ideal for mountain bikers of all skill levels but especially great for those just getting into the sport. Think of Poverty Creek Trail as the “spine;” there are many trails that branch off of Poverty Creek that are more challenging."], "location": ["37.28189", "-80.468196"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=383000", "name": "Pandapas Pond & Poverty Creek Trails"}, {"description": ["Located on the border of Craig and Botetourt counties is the Patterson Creek Trail System. This forgotten hiking trail system that is being revived by the", "Roanoke IMBA chapter", "and includes multiple loop options and fairly difficult terrain."], "location": ["37.551246", "-79.976006"], "map_embed": null, "name": "Patterson Creek Trail System"}, {"description": ["Dogwood Glen Trail is a 5-mile hike with scenic lake, wildlife, and wooded views. This trail stretches from Salthouse Branch Park at Philpott Lake to the Philpott Park Tailrace.", "There are some tough climbs and a few short downhill segments.. Various stretches of the trail run along the shoreline of Philpott Lake. The approximately 7-foot wide trail can be accessed from Philpott Dam (Franklin County side) or Salthouse Branch Park. Parking is limited at Salthouse Branch Park ($4 day-use fee) and not accessible for equestrians at that location."], "location": "1058 Philpott Rd, Bassett, VA 24055", "map_embed": null, "name": "Philpott’s Dogwood Glen Trail"}, {"description": ["Poor Mountain Natural Area Preserve protects the world’s largest population of the globally rare shrub piratebush, which is restricted to only a handful of sites in the mountains of Virginia, Tennessee, and North Carolina.", "The “Wednesday Trail Crew,” a group of volunteers led by Bill Gordge and the Roanoke Valley Pathfinders, constructed more than 1.5 miles of the trail system at Poor Mountain.", "While the 0.75-mile Piratebush Loop interpretive trail affords a relatively level and easy hiking opportunity, the main loop trail affords a strenuous 3.8-mile hike with over 500 feet of vertical drop and return climb. Stone stairs, scenic vistas, fire ecology, and outstanding looks at Table Mountain pine woodlands make the Poor Mountain Trail a great recreational resource.", "Hiking the loop in a counter-clockwise direction provides the easiest hike. Hike in a clockwise direction if you want more of a challenge."], "location": ["37.2362", "-80.0917"], "map_embed": null, "name": "Poor Mountain Natural Area Preserve"}, {"description": ["This 100-acre gem overlooking Claytor Lake Dam is designed for mountain biking, trail running, hiking, walking, and bird watching. Built to International Mountain Biking guidelines, this property features 12 trails that cover 8-10 miles of serene habitat.", "The trails vary from easy to advanced. You will see plenty of birds, an occasional deer and the lake. A permit is required to mountain bike at the park; get a permit from the city manager’s office at 619 Second Street, Radford."], "location": ["37.0887054", "-80.5726115"], "map_embed": null, "name": "Radford Mountain Bike Park"}, {"description": ["Read Mountain is a 243-acre park in Roanoke County and one of the county’s largest passive recreation areas.", "The park includes a 5-mile trail system with moderate to strenuous levels of difficulty. The main feature of the park is a 2-mile trail to Read Mountain’s summit, known as Buzzards Rock. The view from the top is one of the best in the Roanoke Region."], "location": "6101 Crumpacker Dr., Roanoke, VA 24012", "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=525850", "name": "Read Mountain"}, {"description": ["Roaring Run is an excellent hiking trail for the whole family. The easy, well-marked trail begins at an historic iron furnace and winds back and forth along the Roaring Run stream. You will pass rock walls, cascading water, and cross five footbridges before ending at beautiful Roaring Run Falls.", "It is also a great trout stream with a natural water slide at lower levels. At higher levels it becomes a Class V+ creek.", "Easy (out and back hike)", "Approximately half way to the falls is a natural water slide", "Toilets and picnic area with charcoal grill"], "location": ["37.7084056", "-79.8987163"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=409052", "name": "Roaring Run"}, {"description": ["Rock Castle Gorge is an incredible 11-mile hike just off the Blue Ridge Parkway. There are several variations you can do for shorter mileage but completing the entire loop is totally worthwhile.", "Sheltered within the deep, narrow confines of Rock Castle Gorge is a surprising variety of plant life. There are 200 species of wild flowers, 45 species of trees and 28 species of ferns along the  trail. The gorge also has a stunning wildflower display boasting nearly 200 species from April through early May, all within day hiking distance of the Blue Ridge Parkway. The loop encompasses high, open meadows with an impressive panoramic view as well as the narrow confines of the Gorge, making for a strenuous, but rewarding day hike."], "location": ["36.80759", "-80.33105"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526035", "name": "Rock Castle Gorge"}, {"description": ["Sharp Top hike is a classic 3-mile round trip, out and back hike at the Peaks of Otter.", "Sharp Top was long thought to be Virginia’s tallest mountain, when in fact, it is not even the tallest of the Peaks of Otter. Nearby Flat Top rises to 4,001 feet. Mount Rogers near the North Carolina border is Virginia’s tallest mountain at 5,729.", "Begin the hike at the Peaks of Otter Visitor Center. Cross the Blue Ridge Parkway staying on the sidewalk for about 200 yards and then turn right across Route 43 heading to the Sharp Top parking area. After crossing Route 43 there is an intersection on the left that leads to the Lake Trail. Stay on the sidewalk and the trail head is to the left of the Camp Store. The trail is un-blazed but well worn.", "For such a short trail to the peak, it will give you quite a workout with multiple series of steps", "throughout the hike. From the trailhead to the first good overlook", "is about 1 mile. Continue on the trail for about .3 of a mile and you will reach the Buzzard’s Roost Trail intersection. Bear left and go about 0.2 miles to the top. There is a stone cottage", "at the peak. The summit", "offers an impressive 360-degree view of the Peaks of Otter area."], "location": ["37.43300", "-79.605"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526490", "name": "Sharp Top"}, {"description": ["Smart View Recreational Area offers several hiking trails and picnic areas. Located along the Blue Ridge Parkway, Smart View also offers excellent views of the Virginia Piedmont. Three miles of trails meander through moist deciduous woodlands, hardwood forests, and open fields.", "This site is great place to bird during spring migration, but summer also is productive with breeders such as hooded, Kentucky, and black-and white warblers, Acadian and great-crested flycatchers, blue-gray gnatcatcher, yellow-throated and red-eyed vireos, chipping sparrow, brown thrasher, and scarlet tanager."], "location": ["36.9240001", "-80.1897198"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526629", "name": "Smart View Trail"}, {"description": ["The 37-acre Smith Mountain Lake Community Park opened in June 2007. It is a family oriented facility providing swimming, fishing, and family recreation.", "The park is open year-round and offers a partly-covered handicap accessible fishing pier with seating, picnic shelters with grill, playground area, restrooms, hiking, jogging, and a beach with lifeguards on duty when open.", "The park includes 3 miles of pleasant lake and wooded view hiking. Entry and exit points are scattered throughout the park."], "location": "1480 Park Way Ave., Moneta, VA 24121", "map_embed": null, "name": "Smith Mountain Lake Community Park"}, {"description": ["Stewarts Knob Trail is an easy half-mile hike located at milepost 110.6 on the Blue Ridge Parkway."], "location": ["37.296366", "-79.872592"], "map_embed": null, "name": "Stewarts Knob Trail"}, {"description": ["Stiles Falls is a 60-foot waterfall located on Camp Alta Mons property. The trail is closed to the public while summer camp is in session.", "The hike is about 3 miles long. From the camp office, walk up the road past the swimming pool, the retreat center, and the pond. After about ½ mile pass an old barn and then cross over a bridge. Continue along the dirt road until you come to a sign indicating “Falls.”\u009d Follow the trail to the falls crossing the creek several times."], "location": ["37.0991398599", "-80.2490758896"], "map_embed": null, "name": "Stiles Falls"}, {"description": ["This 5-mile loop trail offers you a chance to leave everything behind. Odds of running into another hiker are close to zero. The upper portion of the trail affords views of surrounding valley and mountains.", "Directions to the trailhead", "From I-81, take Exit 150 to Route 220N to Fincastle", "Turn left on Route 606 just before downtown Fincastle", "Continue straight through stop sign", "Follow for ~6.5 miles and you will climb a large mountain", "Park at top on right side", "Trail begins here (not marked)"], "location": ["37.544114", "-79.968182"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=526005", "name": "Sulphur Springs Ridge & Price Mountain Trail"}, {"description": ["The 6.6-mile out and back hike on the Andy Layne Trail intersects with the Appalachian Trail and ends with incredible views.", "From the trailhead, take the yellow-blazed trail for about 3.1 miles to the intersection with the Appalachian Trail. Turn right onto the white-blazed A.T. (southbound) and reach Tinker Cliffs within 0.75 miles. Enjoy the 180 degree view.", "From 1,300 feet near the trailhead and creek crossings to just a hair under 3,000 feet at the cliffs. Bluff top views are the most prominent feature, but there are also nice creek drainages, intriguing rock formations, and lovely forests on the way. Even the part of the trail that goes through a cow pasture includes pleasant rushing streams and scenic views up toward surrounding ridges. Some tough, steep stretches as it rises 1,700 feet in elevation."], "location": ["37.45754", "-80.01730"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=525894", "name": "Tinker Cliffs (Andy Layne Trail)"}, {"description": ["Tinker Ridge Trail crosses Tinker Creek, which is the site depicted in Annie Dillard’s “Pilgrim at Tinker Creek,” then ascends Tinker Ridge at Hay Rock Overloook, providing spectacular views of Carvins Cove and the Roanoke Valley.", "The 8-mile round trip hike on the Appalachian Trail is just 15 minutes from Downtown Roanoke and is of moderate difficulty."], "location": ["37.39086", "-79.90620"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=481607", "name": "Tinker Ridge/Hay Rock Overlook"}, {"description": ["One of the classic trails located inside Douthat State Park. This 10-mile trail is strenuous but rewarding with incredible views and wildlife encounters.", "From the Beaver Dam Campground follow the orange blazed Salt Stump Trail up the mountain for 2.43 miles. Take a left onto the white blazed Middle Mountain Trail and follow the top of the ridge for 1.77 miles. Take another left onto the yellow blazed Tuscarora Overlook trail. In about 1 mile you will arrive at a Y intersection. Take a left to the overlook offering sweeping views of the region.", "After taking a good break, backtrack to the Y intersection and take a right onto the blue blazed Blue Suck Falls trail. Follow it down the mountain to the waterfall. Continue to follow the trail along the creek. Make sure to follow the Blue Suck Falls trail all the way down to the Heron Run trail. Take a left onto the Heron Run trail, which takes you on the West side of the lake. You will then traverse the Lakeside Campground and take a left on the main road to reach the Beaver Dam Campground."], "location": ["37.9665185", "-79.4211501"], "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=525901", "name": "Tuscarora Trail"}, {"description": ["This overnight backpacking trip begins and ends at the Route 311 Appalachian Trail head.", "This is a difficult hike totaling about 32 miles.", "Hike North on the AT, pass McAfee Knob, turn left down Andy Layne Trail, cross to North Mountain Trail, hike south to Route 311, cross Route 311 and hike up to Dragon’s Tooth, continue North on the AT back to Route 311 parking lot.", "There are several AT shelters along the first section (McAfee Knob) that you can use; after that it is primitive tent camping wherever you find a relatively flat spot."], "location": "6128 Catawba Valley Dr., Catawba, VA 24070", "map_embed": "http://www.trimbleoutdoors.com/Maps/EmbeddedMap.aspx?tripId=1186317", "name": "Virginia Triple Crown Loop"}, {"description": ["Waid Recreation Area is a 220-acre facility located near Rocky Mount, along the site of the Old Carolina Wagon Trail. The park is nestled near the Pigg River, which is home of the “Pigg River Ramble.”", "More than 400 acres of rolling terrain and creek crossings make this area great for beginners and more experienced hikers and bikers. The location also hosts various special events and athletic leagues.", "Amenities include:", "7 miles of walking and hiking trails", "2 walking tracks", "Equestrian trails", "Covered picnic shelters, pavilions, and grills", "2 playgrounds", "Fishing, canoeing, and kayaking", "Soccer, baseball & softball fields"], "location": "701 Waid Park Rd., Rocky Mount, VA 24151", "map_embed": null, "name": "Waid Recreation Park"}, {"description": ["Located 40 minutes from downtown Roanoke in scenic Craig County, Wilderness Adventure at Eagle Landing is a full-service outdoor adventure center, summer adventure camp, and retreat center. Wilderness Adventure at Eagle Landing specializes in creating custom adventure programs for groups ranging from two to 100 people."], "location": "11176 Peaceful Valley Rd., New Castle, VA 24127", "map_embed": null, "name": "Wilderness Adventure at Eagle Landing"}]